<footer class="footer">
    <div class="upper-footer">
        <div class="upper-footer__container">
            <div class="subscribe-block">
                <div class="subscribe-block__text">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="white" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_388_935)">
                            <path d="M17.5585 2.38982H2.44569C1.09663 2.38982 0 3.48645 0 4.83551V15.1645C0 16.5136 1.09663 17.6102 2.44569 17.6102H17.5543C18.9034 17.6102 20 16.5136 20 15.1645V4.83964C20.0041 3.49059 18.9075 2.38982 17.5585 2.38982ZM18.8868 15.1645C18.8868 15.897 18.2909 16.4929 17.5585 16.4929H2.44569C1.71322 16.4929 1.11732 15.897 1.11732 15.1645V4.83964C1.11732 4.10718 1.71322 3.51128 2.44569 3.51128H17.5543C18.2868 3.51128 18.8827 4.10718 18.8827 4.83964V15.1645H18.8868Z"/>
                            <path d="M12.6108 9.87172L17.5022 5.48521C17.7298 5.2783 17.7505 4.92655 17.5436 4.69481C17.3367 4.46721 16.9849 4.44651 16.7532 4.65342L10.0079 10.7076L8.69193 9.53238C8.68779 9.52824 8.68365 9.52411 8.68365 9.51997C8.65468 9.491 8.62571 9.46617 8.59261 9.44134L3.23776 4.64929C3.00602 4.44238 2.65427 4.46307 2.44736 4.69481C2.24045 4.92655 2.26114 5.2783 2.49288 5.48521L7.44218 9.90896L2.51357 14.5231C2.29011 14.7341 2.27769 15.0859 2.48874 15.3135C2.60047 15.4293 2.74945 15.4914 2.89842 15.4914C3.03498 15.4914 3.17155 15.4418 3.27914 15.3424L8.28224 10.6621L9.63958 11.8746C9.74717 11.9698 9.87959 12.0153 10.012 12.0153C10.1444 12.0153 10.281 11.9657 10.3845 11.8705L11.779 10.6207L16.7532 15.3466C16.8608 15.45 17.0015 15.4997 17.138 15.4997C17.287 15.4997 17.4318 15.4418 17.5436 15.3259C17.7546 15.1024 17.7463 14.7465 17.5229 14.5355L12.6108 9.87172Z"/>
                        </g>
                        <defs>
                            <clipPath id="clip0_388_935">
                                <rect width="20" height="20" fill="white"/>
                            </clipPath>
                        </defs>
                    </svg>

                    <span>
                        <span class="light-green-text">Подпишитесь</span>
                        <br>
                        на новости и акции
                    </span>
                </div>

                <div class="subscribe-block__form">
                    <form class="subscribe-form" action="">
                        <input class="subscribe-form__input" type="email" name="email" placeholder="Введите email" required>

                        <button class="subscribe-form__submit" type="submit">Подписаться</button>
                    </form>
                </div>
            </div>

            <div class="feedback-block">
                <a href="#" class="feedback__link">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="white" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_388_945)">
                            <path d="M15.8074 12.3893C15.3979 11.963 14.9041 11.735 14.3806 11.735C13.8614 11.735 13.3633 11.9587 12.937 12.3851L11.6031 13.7147C11.4934 13.6556 11.3836 13.6008 11.2781 13.5459C11.1261 13.4699 10.9826 13.3981 10.8602 13.3222C9.61076 12.5286 8.47527 11.4944 7.38622 10.1563C6.85857 9.48937 6.504 8.92795 6.24651 8.3581C6.59264 8.04152 6.91345 7.71227 7.22581 7.39568C7.34401 7.27749 7.4622 7.15508 7.58039 7.03688C8.46683 6.15045 8.46683 5.0023 7.58039 4.11586L6.42802 2.96349C6.29716 2.83263 6.16209 2.69756 6.03545 2.56248C5.78218 2.30077 5.51625 2.03062 5.24188 1.77735C4.83243 1.37212 4.34278 1.15684 3.8278 1.15684C3.31282 1.15684 2.81472 1.37212 2.39261 1.77735C2.38839 1.78157 2.38839 1.78157 2.38417 1.78579L0.948981 3.23364C0.408676 3.77395 0.100533 4.43244 0.0329944 5.19647C-0.068313 6.42904 0.294705 7.57719 0.5733 8.32855C1.25712 10.1732 2.27864 11.8828 3.80247 13.7147C5.65133 15.9224 7.87587 17.6657 10.417 18.8941C11.3879 19.3542 12.6837 19.8987 14.1316 19.9916C14.2202 19.9958 14.3131 20 14.3975 20C15.3726 20 16.1915 19.6496 16.8331 18.9532C16.8373 18.9447 16.8458 18.9405 16.85 18.932C17.0695 18.6661 17.3228 18.4255 17.5887 18.168C17.7702 17.995 17.9559 17.8134 18.1375 17.6235C18.5553 17.1887 18.7748 16.6822 18.7748 16.163C18.7748 15.6396 18.5511 15.1372 18.1248 14.7151L15.8074 12.3893ZM17.3186 16.8341C17.3143 16.8341 17.3143 16.8384 17.3186 16.8341C17.1539 17.0114 16.9851 17.1718 16.8036 17.3491C16.5292 17.6108 16.2506 17.8852 15.9889 18.1933C15.5626 18.6492 15.0602 18.8645 14.4017 18.8645C14.3384 18.8645 14.2709 18.8645 14.2076 18.8603C12.9539 18.7801 11.7889 18.2904 10.9151 17.8725C8.52592 16.716 6.42802 15.0739 4.68469 12.9929C3.24528 11.258 2.28286 9.65399 1.64547 7.93177C1.2529 6.8807 1.10938 6.0618 1.1727 5.28933C1.21491 4.79546 1.40486 4.38601 1.75522 4.03566L3.19463 2.59625C3.40146 2.40208 3.62096 2.29655 3.83624 2.29655C4.10217 2.29655 4.31745 2.45695 4.45253 2.59203C4.45675 2.59625 4.46097 2.60047 4.46519 2.60469C4.72268 2.8453 4.9675 3.09434 5.22499 3.36028C5.35585 3.49535 5.49093 3.63043 5.626 3.76973L6.77837 4.9221C7.22581 5.36954 7.22581 5.78321 6.77837 6.23065C6.65596 6.35306 6.53777 6.47547 6.41535 6.59367C6.06078 6.95668 5.72309 7.29437 5.35585 7.62362C5.34741 7.63207 5.33896 7.63629 5.33474 7.64473C4.97173 8.00775 5.03926 8.36232 5.11524 8.60293C5.11947 8.61559 5.12369 8.62825 5.12791 8.64092C5.42761 9.36695 5.84972 10.0508 6.49133 10.8655L6.49556 10.8697C7.66059 12.3049 8.88894 13.4235 10.2439 14.2804C10.417 14.3901 10.5943 14.4787 10.7631 14.5632C10.9151 14.6392 11.0586 14.7109 11.181 14.7869C11.1979 14.7953 11.2148 14.808 11.2317 14.8164C11.3752 14.8882 11.5103 14.922 11.6496 14.922C11.9999 14.922 12.2194 14.7025 12.2912 14.6307L13.7348 13.1871C13.8783 13.0436 14.1063 12.8705 14.3722 12.8705C14.6339 12.8705 14.8492 13.0351 14.98 13.1786C14.9843 13.1829 14.9843 13.1829 14.9885 13.1871L17.3143 15.5129C17.7491 15.9435 17.7491 16.3867 17.3186 16.8341Z"/>
                            <path d="M10.8128 4.75748C11.9188 4.94321 12.9234 5.46663 13.7254 6.26864C14.5274 7.07066 15.0466 8.07529 15.2366 9.18123C15.283 9.45982 15.5236 9.654 15.798 9.654C15.8318 9.654 15.8613 9.64977 15.8951 9.64555C16.2074 9.5949 16.4143 9.29942 16.3636 8.98706C16.1357 7.64896 15.5025 6.42905 14.5359 5.46241C13.5692 4.49577 12.3493 3.8626 11.0112 3.63465C10.6988 3.584 10.4076 3.79084 10.3527 4.09898C10.2978 4.40712 10.5004 4.70682 10.8128 4.75748Z"/>
                            <path d="M19.9795 8.82243C19.6039 6.619 18.5655 4.61396 16.9699 3.01837C15.3743 1.42278 13.3692 0.384378 11.1658 0.00869726C10.8577 -0.0461775 10.5664 0.164879 10.5115 0.473022C10.4609 0.785386 10.6677 1.07664 10.9801 1.13152C12.9471 1.46499 14.7411 2.39786 16.1679 3.82038C17.5946 5.24713 18.5232 7.04111 18.8567 9.00816C18.9032 9.28676 19.1438 9.48093 19.4181 9.48093C19.4519 9.48093 19.4814 9.47671 19.5152 9.47249C19.8234 9.42605 20.0344 9.13057 19.9795 8.82243Z"/>
                        </g>
                        <defs>
                            <clipPath id="clip0_388_945">
                                <rect width="20" height="20" fill="white"/>
                            </clipPath>
                        </defs>
                    </svg>

                    <span>Заказать звонок</span>
                </a>
            </div>
        </div>
    </div>

    <div class="bottom-footer__container">
        <div class="bottom-footer">
            <div class="bottom-info">
                <div class="bottom-logo">
                    <a class="bottom-logo__link" href="/">
                        <span class="header-logo__text text-shadow">fotoprokat</span>
                        <span class="header-logo__text text-shadow background-color-text">24</span>
                    </a>
                </div>

                <div class="bottom-description">
                <span>
                    самый удобный в Москве сервис аренды<br>
                    фото-, видео- и кинотехники.
                </span>
                </div>

                <div class="bottom-copyright">
                    © 2015-2023 Fotoprokat24
                </div>

                <div class="bottom-socials">

                </div>
            </div>

            <div class="bottom-navigation">
                <div class="bottom-navigation__company">
                    <p class="bottom-navigation__header">Компания</p>

                    <ul class="bottom-navigation__list">
                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">О компании</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Новости</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Вакансии</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Политика<br>конфиденциальности</a>
                        </li>
                    </ul>
                </div>

                <div class="bottom-navigation__clients">
                    <p class="bottom-navigation__header">Клиентам</p>

                    <ul class="bottom-navigation__list">
                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Точки выдачи</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Скидки</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Бонусные программы</a>
                        </li>
                    </ul>
                </div>

                <div class="bottom-navigation__helps">
                    <p class="bottom-navigation__header">Помощь</p>

                    <ul class="bottom-navigation__list">
                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Вопрос-ответ</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Правила аренды</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Доставка</a>
                        </li>

                        <li class="bottom-navigation__item">
                            <a href="#" class="bottom-navigation__link">Оплата</a>
                        </li>
                    </ul>
                </div>
            </div>

            <div class="bottom-contacts">
                <p class="bottom-contacts__header">Контакты</p>

                <p class="bottom-contacts__text">
                    Fotoprokat24<br>
                    г. Москва, Проспект<br>
                    мира, дом 12<br>
                    Пн—Сб 09:00—21:00<br>
                    +7 (999) 999-99-99<br>
                </p>
            </div>
        </div>
    </div>
</footer>
